<?php 
if (! defined ( 'ABSPATH' ))
    exit (); // Exit if accessed directly

    abstract class Abstract_XH_Social_SMS_Api extends Abstract_XH_Social_Settings{
        const FIELD_MOBILE_NAME='mobile';
        const FIELD_MOBILE_CODE_NAME='mobile_vcode';
        const FIELD_MOBILE_REGION_NAME='region';
        /**
         * 发送短信
         * @param string $mobile
         * @param string $msg_id
         * @param array $params
         * @return XH_Social_Error
         * @since 1.0.0
         */
        abstract function send($msg_id,$mobile, $params);
        
        public function get_field_mobile(){
            $settings[self::FIELD_MOBILE_NAME] =  array(
                'title'=>__('mobile',XH_SOCIAL),
                'type'=>'text',
                'required'=>true,
                'validate'=>function ($name,$datas,$settings){
                    $mobile =isset($_REQUEST[$name])?trim($_REQUEST[$name]):'';
                    $region =isset($_REQUEST["{$name}_region"])?trim($_REQUEST["{$name}_region"]):'';
                    
                    $regions = Abstract_XH_Social_SMS_Api::get_mobile_codes();
                    if(!empty($region)&&!isset($regions[$region])){
                        return XH_Social_Error::error_custom(__('mobile region is invalid!',XH_SOCIAL));
                    }
                    
                    if(empty($mobile)){
                        return XH_Social_Error::error_custom(__('mobile is required!',XH_SOCIAL));
                    }
                
                    if(!XH_Social_Helper::is_mobile($mobile)){
                        return XH_Social_Error::error_custom(__('mobile is invalid!',XH_SOCIAL));
                    }
                
                    $last_send_mobile = XH_Social::instance()->session->get('social_login_mobile_last_send','');
                     
                    $datas[Abstract_XH_Social_SMS_Api::FIELD_MOBILE_NAME]=$mobile;
                    $datas[Abstract_XH_Social_SMS_Api::FIELD_MOBILE_REGION_NAME]=$region;
                    
                    if(!empty($last_send_mobile)&&$last_send_mobile!= $datas[Abstract_XH_Social_SMS_Api::FIELD_MOBILE_NAME]){
                        XH_Social::instance()->WP->clear_captcha();
                        XH_Social_Add_On_Social_Mobile::clear_mobile_validate_code();
                    }
                    
                    //only inner action can called,you can not defined actions in your func
                    $error = apply_filters('wsocial_mobile_validation', XH_Social_Error::success(),$datas);
                    if(!XH_Social_Error::is_valid($error)){
                        return $error;
                    }
                    
                    XH_Social::instance()->session->set('social_login_mobile_last_send',$datas[Abstract_XH_Social_SMS_Api::FIELD_MOBILE_NAME]);
                    return $datas;
                },
                'section'=>array('login','code')
            );
            
            return $settings;
        }
        
        public static function get_mobile_codes(){
            return array('+86'=>'中国大陆', '+1'=>'加拿大/美国','+852'=>'香港','+886'=>'台湾','+81'=>'日本','+82'=>'韩国','+61'=>'澳大利亚','+64'=>'新西兰','+44'=>'英国','+49'=>'德国','+33'=>'法国','+7'=>'哈萨克斯坦','+63'=>'菲律宾','+84'=>'越南','+960'=>'马尔代夫','+378'=>'圣马力诺','+501'=>'伯利兹','+237'=>'喀麦隆','+354'=>'冰岛','+36'=>'匈牙利','+385'=>'克罗地亚','+993'=>'土库曼斯坦','+380'=>'乌克兰','+241'=>'加蓬','+235'=>'乍得','+239'=>'圣多美 和普林西比','+593'=>'厄瓜多尔','+45'=>'丹麦','+967'=>'也门','+27'=>'南非','+62'=>'印度尼西亚','+211'=>'南苏丹','+1784'=>'圣文森特和格林纳丁斯','+1721'=>'圣马丁岛（荷兰部分）','+996'=>'吉尔吉斯斯坦','+253'=>'吉布提','+1869'=>'圣基 茨和尼维斯','+359'=>'保加利亚','+236'=>'中 非共和国','+598'=>'乌拉圭','+57'=>'哥伦比亚','+243'=>'刚果民主共和国','+972'=>'以色列','+267'=>'博茨瓦纳','+233'=>'加纳','+242'=>'刚果共和国','+256'=>'乌干达','+670'=>'东帝汶','+508'=>'圣彼埃尔和密克隆岛','+220'=>'冈比亚','+974'=>'卡塔尔','+231'=>'利比里亚','+998'=>'乌兹别克斯坦','+1671'=>'关岛','+245'=>'几内亚比绍共和国','+98'=>'伊朗','+374'=>'亚美尼亚','+423'=>'列支敦士登','+1758'=>'圣露西亚','+506'=>'哥斯达黎加','+964'=>'伊拉克','+352'=>'卢森堡','+963'=>'叙利亚','+91'=>'印度','+250'=>'卢旺达','+53'=>'古巴','+90'=>'土耳其','+218'=>'利比亚','+975'=>'不丹','+224'=>'几内亚','+1649'=>'特克斯和凯科斯群岛','+238'=>'开普','+880'=>'孟加拉国','+505'=>'尼加拉瓜','+227'=>'尼日尔','+1809'=>'多明尼加共和国','+1264'=>'安圭拉','+234'=>'尼日利亚','+255'=>'坦桑尼亚','+977'=>'尼泊尔','+1767'=>'多米尼加','+92'=>'巴基斯坦','+55'=>'巴西','+381'=>'塞尔维亚','+226'=>'布基纳法索','+1246'=>'巴巴多斯','+376'=>'安道尔','+675'=>'巴布亚新几 内亚','+58'=>'委内瑞拉','+973'=>'巴林','+682'=>'库克群岛','+592'=>'圭亚那','+357'=>'塞浦路斯','+43'=>'奥地利','+248'=>'塞舌尔','+52'=>'墨西哥','+992'=>'塔吉克斯坦','+20'=>'埃及','+507'=>'巴拿马','+599'=>'库拉索','+232'=>'塞拉利昂','+1268'=>'安提瓜 和巴布达','+970'=>'巴勒斯 坦领土','+680'=>'帕劳','+30'=>'希腊','+221'=>'塞内加尔','+257'=>'布隆迪','+686'=>'基里巴斯','+251'=>'埃塞俄比亚','+1242'=>'巴哈马','+228'=>'多哥','+244'=>'安哥拉','+595'=>'巴拉圭','+94'=>'斯里兰卡','+216'=>'突尼斯','+371'=>'拉脱维亚','+1441'=>'百慕大群岛','+269'=>'马约特','+47'=>'挪威','+66'=>'泰国','+372'=>'爱沙尼亚','+689'=>'法属波利尼 西亚','+855'=>'柬埔寨','+222'=>'毛里塔尼亚','+65'=>'新加坡','+230'=>'毛里求斯','+46'=>'瑞典','+594'=>'法属圭亚那','+375'=>'白俄罗斯','+687'=>'新喀里多尼亚','+387'=>'波斯 尼亚和黑塞哥维那','+268'=>'斯威士兰','+421'=>'斯洛伐克','+51'=>'秘鲁','+679'=>'斐济','+966'=>'沙特阿拉伯','+509'=>'海地','+504'=>'洪都拉斯','+373'=>'摩尔多瓦','+32'=>'比利时','+1787'=>'波多黎各','+590'=>'瓜德罗普岛','+965'=>'科威特','+56'=>'智利','+48'=>'波兰','+39'=>'意大利','+298'=>'法罗群岛','+1345'=>'开曼群岛','+350'=>'直布罗陀','+676'=>'汤加','+1868'=>'特立尼 达和多巴哥','+263'=>'津巴布韦','+502'=>'瓜地马拉','+420'=>'捷克','+591'=>'玻利维亚','+386'=>'斯洛文尼亚','+853'=>'澳门','+262'=>'留尼汪','+41'=>'瑞士','+1876'=>'牙买加','+995'=>'格鲁吉亚','+1473'=>'格林纳达','+353'=>'爱尔兰','+673'=>'文莱','+299'=>'格陵兰岛','+377'=>'摩纳哥','+677'=>'所罗门群岛','+678'=>'瓦努阿图','+212'=>'摩洛哥','+254'=>'肯尼亚','+597'=>'苏里南','+856'=>'老挝','+40'=>'罗马尼亚','+249'=>'苏丹','+95'=>'缅甸','+370'=>'立陶宛','+252'=>'索马里','+1684'=>'美属萨摩亚','+358'=>'芬兰','+264'=>'纳米比亚','+962'=>'约旦','+229'=>'贝宁','+356'=>'马耳他','+258'=>'莫桑比克','+213'=>'阿尔及利亚','+225'=>'象牙海岸','+93'=>'阿富汗','+265'=>'马拉维','+1664'=>'蒙特塞拉特岛','+503'=>'萨尔瓦多','+247'=>'阿森松岛','+971'=>'阿拉伯 联合酋长国','+685'=>'萨摩亚','+297'=>'阿鲁巴','+968'=>'阿曼','+355'=>'阿尔巴尼亚','+994'=>'阿塞拜疆','+976'=>'蒙古','+596'=>'马提尼克','+260'=>'赞比亚','+266'=>'莱索托','+389'=>'马其顿','+34'=>'西班牙','+351'=>'葡萄牙','+240'=>'赤道几内亚','+31'=>'荷兰','+60'=>'马来西亚','+54'=>'阿根廷','+261'=>'马达加斯加','+223'=>'马里','+961'=>'黎巴嫩','+382'=>'黑山');
        }
         
    }
?>